Revit 2017 API
AssetPropertyInt64 Class
 Represents a property of Int64 value.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public class AssetPropertyInt64 : AssetProperty
Visual Basic
Public Class AssetPropertyInt64 _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyInt64 : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyInt64
See Also
AssetPropertyInt64 Members
Autodesk.Revit.Utility Namespace